test/fixtures/files/stripe/customer_subscription_created.json

{
  "id": "evt_1HhtTXI4g05dLynGOBIUqAgv",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1604048446,
  "data": {
    "object": {
      "id": "NEW PAID SUBSCRIPTION",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1604048445,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1604048445,
      "current_period_end": 1606726845,
      "current_period_start": 1604048445,
      "customer": "cus_IH5PWpIdBB3x5K",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_IIUS3ZBu8M6vjy",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1604048445,
            "metadata": {
            },
            "plan": {
              "id": "price_1HgXExI4g05dLynGTal6afTz",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 11499,
              "amount_decimal": "11499",
              "billing_scheme": "per_unit",
              "created": 1603724647,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_IH5P8pyVBFoP0O",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1HgXExI4g05dLynGTal6afTz",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1603724647,
              "currency": "gbp",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_IH5P8pyVBFoP0O",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 11499,
              "unit_amount_decimal": "11499"
            },
            "quantity": 1,
            "subscription": "sub_IIUSy8xtFXRkek",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_IIUSy8xtFXRkek"
      },
      "latest_invoice": "in_1HhtTVI4g05dLynGvntB0un5",
      "livemode": false,
      "metadata": {
        "subscription_id": "9"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1HgXExI4g05dLynGTal6afTz",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 11499,
        "amount_decimal": "11499",
        "billing_scheme": "per_unit",
        "created": 1603724647,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_IH5P8pyVBFoP0O",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1604048445,
      "status": "incomplete",
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": "req_Q6mrKI3Ca7ynkC",
    "idempotency_key": null
  },
  "type": "customer.subscription.created"
}
