test/fixtures/files/stripe/customer_subscription_deleted.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.deleted",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2020-08-27",
  "data": {
    "object": {
      "id": "NEW PAID SUBSCRIPTION",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1605264236,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1605264236,
      "current_period_end": 1607856236,
      "current_period_start": 1605264236,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "discount": null,
      "ended_at": 1605264074,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1605264237,
            "metadata": {
            },
            "price": {
              "id": "gold_00000000000000",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1590202335,
              "currency": "czk",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_00000000000000",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "quantity": 1,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_INlH5jnK29UUcT"
      },
      "latest_invoice": null,
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "schedule": null,
      "start_date": 1605264236,
      "status": "canceled",
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    }
  }
}
